examples/performance/java-lambda-optimization/measurements/final/uc2-snapstart-run1-20260318-083328.txt

Summary:
  Total:	48.6019 secs
  Slowest:	4.5409 secs
  Fastest:	0.1417 secs
  Average:	0.3166 secs
  Requests/sec:	41.0478
  
  Total data:	1142281 bytes
  Size/request:	572 bytes

Response time histogram:
  0.142 [1]	|
  0.582 [1780]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.022 [144]	|■■■
  1.461 [24]	|■
  1.901 [27]	|■
  2.341 [3]	|
  2.781 [3]	|
  3.221 [4]	|
  3.661 [7]	|
  4.101 [1]	|
  4.541 [1]	|


Latency distribution:
  10%% in 0.1617 secs
  25%% in 0.1755 secs
  50%% in 0.2094 secs
  75%% in 0.2673 secs
  90%% in 0.6210 secs
  95%% in 0.7830 secs
  99%% in 1.9670 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0013 secs, 0.0000 secs, 0.4302 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0116 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0008 secs
  resp wait:	0.3136 secs, 0.1415 secs, 4.5407 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0023 secs

Status code distribution:
  [200]	1988 responses
  [502]	7 responses