examples/performance/java-lambda-optimization/measurements/final/uc2-snapstart-run2-20260318-083328.txt

Summary:
  Total:	47.3964 secs
  Slowest:	3.6117 secs
  Fastest:	0.1403 secs
  Average:	0.3101 secs
  Requests/sec:	42.0918
  
  Total data:	1143846 bytes
  Size/request:	573 bytes

Response time histogram:
  0.140 [1]	|
  0.487 [1761]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.835 [145]	|■■■
  1.182 [17]	|
  1.529 [32]	|■
  1.876 [18]	|
  2.223 [0]	|
  2.570 [2]	|
  2.917 [7]	|
  3.265 [6]	|
  3.612 [6]	|


Latency distribution:
  10%% in 0.1590 secs
  25%% in 0.1725 secs
  50%% in 0.2073 secs
  75%% in 0.2522 secs
  90%% in 0.5997 secs
  95%% in 0.7651 secs
  99%% in 2.5807 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0009 secs, 0.0000 secs, 0.1252 secs
  DNS-lookup:	0.0004 secs, 0.0000 secs, 0.0548 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0027 secs
  resp wait:	0.3090 secs, 0.1400 secs, 3.6116 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0036 secs

Status code distribution:
  [200]	1991 responses
  [502]	4 responses