examples/performance/java-lambda-optimization/measurements/final/uc2-snapstart-run3-20260318-083328.txt

Summary:
  Total:	49.2225 secs
  Slowest:	4.3003 secs
  Fastest:	0.1412 secs
  Average:	0.3039 secs
  Requests/sec:	40.5303
  
  Total data:	1142152 bytes
  Size/request:	572 bytes

Response time histogram:
  0.141 [1]	|
  0.557 [1807]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.973 [119]	|■■■
  1.389 [14]	|
  1.805 [28]	|■
  2.221 [3]	|
  2.637 [5]	|
  3.053 [6]	|
  3.468 [4]	|
  3.884 [7]	|
  4.300 [1]	|


Latency distribution:
  10%% in 0.1581 secs
  25%% in 0.1730 secs
  50%% in 0.2051 secs
  75%% in 0.2402 secs
  90%% in 0.5242 secs
  95%% in 0.7573 secs
  99%% in 2.5661 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0000 secs, 0.0853 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0134 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0016 secs
  resp wait:	0.3031 secs, 0.1410 secs, 4.3001 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0020 secs

Status code distribution:
  [200]	1988 responses
  [502]	7 responses