examples/performance/java-lambda-optimization/measurements/final/uc2-standard-run1-20260318-083328.txt

Summary:
  Total:	56.1410 secs
  Slowest:	9.5850 secs
  Fastest:	0.1469 secs
  Average:	0.3556 secs
  Requests/sec:	35.5355
  
  Total data:	1139119 bytes
  Size/request:	570 bytes

Response time histogram:
  0.147 [1]	|
  1.091 [1913]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.035 [58]	|■
  2.978 [2]	|
  3.922 [16]	|
  4.866 [0]	|
  5.810 [0]	|
  6.754 [0]	|
  7.697 [0]	|
  8.641 [3]	|
  9.585 [2]	|


Latency distribution:
  10%% in 0.1737 secs
  25%% in 0.1892 secs
  50%% in 0.2292 secs
  75%% in 0.3233 secs
  90%% in 0.6187 secs
  95%% in 0.8170 secs
  99%% in 3.0619 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0000 secs, 0.0856 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0206 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0119 secs
  resp wait:	0.3548 secs, 0.1465 secs, 9.5848 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0039 secs

Status code distribution:
  [200]	1988 responses
  [502]	7 responses