examples/performance/java-lambda-optimization/measurements/final/uc2-standard-run2-20260318-083328.txt

Summary:
  Total:	47.3066 secs
  Slowest:	3.5461 secs
  Fastest:	0.1478 secs
  Average:	0.3061 secs
  Requests/sec:	42.1717
  
  Total data:	1140933 bytes
  Size/request:	571 bytes

Response time histogram:
  0.148 [1]	|
  0.488 [1745]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.827 [181]	|■■■■
  1.167 [14]	|
  1.507 [27]	|■
  1.847 [15]	|
  2.187 [0]	|
  2.527 [0]	|
  2.866 [1]	|
  3.206 [4]	|
  3.546 [7]	|


Latency distribution:
  10%% in 0.1656 secs
  25%% in 0.1766 secs
  50%% in 0.2129 secs
  75%% in 0.2845 secs
  90%% in 0.5903 secs
  95%% in 0.7416 secs
  99%% in 1.6472 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0007 secs, 0.0000 secs, 0.0961 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0100 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0012 secs
  resp wait:	0.3052 secs, 0.1476 secs, 3.5459 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0122 secs

Status code distribution:
  [200]	1992 responses
  [502]	3 responses