examples/performance/java-lambda-optimization/measurements/final/uc3-lmi-run2-20260318-083328.txt

Summary:
  Total:	15.3714 secs
  Slowest:	0.5240 secs
  Fastest:	0.0715 secs
  Average:	0.1109 secs
  Requests/sec:	129.7866
  
  Total data:	329176 bytes
  Size/request:	165 bytes

Response time histogram:
  0.072 [1]	|
  0.117 [1428]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.162 [279]	|■■■■■■■■
  0.207 [223]	|■■■■■■
  0.253 [29]	|■
  0.298 [4]	|
  0.343 [14]	|
  0.388 [12]	|
  0.434 [0]	|
  0.479 [0]	|
  0.524 [5]	|


Latency distribution:
  10%% in 0.0799 secs
  25%% in 0.0834 secs
  50%% in 0.0887 secs
  75%% in 0.1338 secs
  90%% in 0.1753 secs
  95%% in 0.1833 secs
  99%% in 0.3192 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0007 secs, 0.0000 secs, 0.0900 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0111 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0014 secs
  resp wait:	0.1101 secs, 0.0713 secs, 0.5239 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0105 secs

Status code distribution:
  [200]	1995 responses