examples/performance/java-lambda-optimization/measurements/final/uc3-lmi-run3-20260318-083328.txt

Summary:
  Total:	16.9225 secs
  Slowest:	0.5928 secs
  Fastest:	0.0721 secs
  Average:	0.1235 secs
  Requests/sec:	117.8903
  
  Total data:	329177 bytes
  Size/request:	165 bytes

Response time histogram:
  0.072 [1]	|
  0.124 [1171]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.176 [558]	|■■■■■■■■■■■■■■■■■■■
  0.228 [231]	|■■■■■■■■
  0.280 [4]	|
  0.332 [14]	|
  0.384 [1]	|
  0.437 [0]	|
  0.489 [0]	|
  0.541 [0]	|
  0.593 [15]	|■


Latency distribution:
  10%% in 0.0804 secs
  25%% in 0.0842 secs
  50%% in 0.0927 secs
  75%% in 0.1676 secs
  90%% in 0.1772 secs
  95%% in 0.1792 secs
  99%% in 0.3178 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0031 secs, 0.0000 secs, 0.4157 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0134 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0011 secs
  resp wait:	0.1202 secs, 0.0719 secs, 0.3352 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0024 secs

Status code distribution:
  [200]	1995 responses