examples/performance/java-lambda-optimization/measurements/final/uc3-native-run1-20260318-083328.txt

Summary:
  Total:	18.0539 secs
  Slowest:	1.1379 secs
  Fastest:	0.0751 secs
  Average:	0.1312 secs
  Requests/sec:	110.5024
  
  Total data:	329187 bytes
  Size/request:	165 bytes

Response time histogram:
  0.075 [1]	|
  0.181 [1876]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.288 [72]	|■■
  0.394 [32]	|■
  0.500 [9]	|
  0.607 [0]	|
  0.713 [0]	|
  0.819 [1]	|
  0.925 [0]	|
  1.032 [1]	|
  1.138 [3]	|


Latency distribution:
  10%% in 0.0854 secs
  25%% in 0.0896 secs
  50%% in 0.1026 secs
  75%% in 0.1737 secs
  90%% in 0.1778 secs
  95%% in 0.1873 secs
  99%% in 0.3178 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0000 secs, 0.0798 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0105 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0045 secs
  resp wait:	0.1304 secs, 0.0750 secs, 1.1378 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0062 secs

Status code distribution:
  [200]	1995 responses