examples/performance/java-lambda-optimization/measurements/final/uc3-native-run2-20260318-083328.txt

Summary:
  Total:	16.4471 secs
  Slowest:	0.4871 secs
  Fastest:	0.0753 secs
  Average:	0.1194 secs
  Requests/sec:	121.2979
  
  Total data:	329178 bytes
  Size/request:	165 bytes

Response time histogram:
  0.075 [1]	|
  0.116 [1299]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.158 [267]	|■■■■■■■■
  0.199 [360]	|■■■■■■■■■■■
  0.240 [14]	|
  0.281 [16]	|
  0.322 [33]	|■
  0.364 [3]	|
  0.405 [0]	|
  0.446 [0]	|
  0.487 [2]	|


Latency distribution:
  10%% in 0.0838 secs
  25%% in 0.0878 secs
  50%% in 0.0966 secs
  75%% in 0.1439 secs
  90%% in 0.1769 secs
  95%% in 0.1836 secs
  99%% in 0.2969 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0000 secs, 0.0830 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0139 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0043 secs
  resp wait:	0.1186 secs, 0.0751 secs, 0.4870 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0030 secs

Status code distribution:
  [200]	1995 responses