examples/performance/java-lambda-optimization/measurements/final/uc3-snapstart-run2-20260318-083328.txt

Summary:
  Total:	18.4981 secs
  Slowest:	1.9932 secs
  Fastest:	0.0722 secs
  Average:	0.1331 secs
  Requests/sec:	107.8492
  
  Total data:	329181 bytes
  Size/request:	165 bytes

Response time histogram:
  0.072 [1]	|
  0.264 [1932]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.456 [11]	|
  0.648 [29]	|■
  0.841 [7]	|
  1.033 [5]	|
  1.225 [6]	|
  1.417 [2]	|
  1.609 [1]	|
  1.801 [0]	|
  1.993 [1]	|


Latency distribution:
  10%% in 0.0847 secs
  25%% in 0.0890 secs
  50%% in 0.0963 secs
  75%% in 0.1550 secs
  90%% in 0.1766 secs
  95%% in 0.1856 secs
  99%% in 0.6896 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0022 secs, 0.0000 secs, 0.3794 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0215 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0060 secs
  resp wait:	0.1294 secs, 0.0720 secs, 1.9930 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0188 secs

Status code distribution:
  [200]	1995 responses