examples/performance/java-lambda-optimization/measurements/final/uc3-snapstart-run3-20260318-083328.txt

Summary:
  Total:	16.7845 secs
  Slowest:	0.5444 secs
  Fastest:	0.0727 secs
  Average:	0.1242 secs
  Requests/sec:	118.8598
  
  Total data:	329186 bytes
  Size/request:	165 bytes

Response time histogram:
  0.073 [1]	|
  0.120 [1173]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.167 [250]	|■■■■■■■■■
  0.214 [528]	|■■■■■■■■■■■■■■■■■■
  0.261 [22]	|■
  0.309 [3]	|
  0.356 [17]	|■
  0.403 [0]	|
  0.450 [0]	|
  0.497 [0]	|
  0.544 [1]	|


Latency distribution:
  10%% in 0.0829 secs
  25%% in 0.0868 secs
  50%% in 0.0955 secs
  75%% in 0.1731 secs
  90%% in 0.1777 secs
  95%% in 0.1823 secs
  99%% in 0.2933 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0007 secs, 0.0000 secs, 0.1039 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0304 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0051 secs
  resp wait:	0.1232 secs, 0.0727 secs, 0.5443 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0059 secs

Status code distribution:
  [200]	1995 responses